03_mesh_independence/layered_case_v2/layered_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          1000;
        startFace       749862;
    }
    outlet
    {
        type            patch;
        nFaces          1000;
        startFace       750862;
    }
    topandbottom
    {
        type            patch;
        nFaces          3200;
        startFace       751862;
    }
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          17378;
        startFace       755062;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          17378;
        startFace       772440;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12960;
        startFace       789818;
    }
)

// ************************************************************************* //
