03_mesh_independence/layered_case_v2/layered_case/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4e-05;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 4e-05;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 4e-05;
    }

    topandbottom
    {
        type            freestream;
        freestreamValue uniform 4e-05;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }

    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }
}
